tap "homebrew/bundle"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/services"
brew "cloudflared"
brew "fd"
brew "fnm"
brew "git-cliff"
brew "htop"
brew "iperf3"
brew "openvpn"
brew "python@3.12"
brew "ripgrep"
brew "sing-box"
brew "tmux"
brew "tree"
brew "typst"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "cyberduck"
cask "devutils"
cask "figma"
cask "font-fontawesome"
cask "font-meslo-lg-nerd-font"
cask "font-noto-nerd-font"
cask "font-noto-sans-cjk-sc"
cask "font-noto-serif-cjk-sc"
cask "iina"
cask "iterm2"
cask "linear-linear"
cask "monitorcontrol"
cask "notion"
cask "obsidian"
cask "raycast"
cask "sublime-text"
cask "surge"
cask "telegram"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "executablebookproject.myst-highlight"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "heybourn.headwind"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "nvarner.typst-lsp"
vscode "oderwat.indent-rainbow"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
