davidanson.vscode-markdownlint
donjayamanne.githistory
eamodio.gitlens
jithurjacob.nbpreviewer
justusadam.language-haskell
ms-python.python
ms-vscode.cpptools
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
njpwerner.autodocstring
redhat.vscode-yaml
scala-lang.scala
